docs/index.org
* 注意事项
* 网址
   http://192.241.196.189:10010

** 返回的格式

- 返回的数据格式为json。
- 如果出错的话，header中的http status就不是200， 如果正常就为200.在出错的情况下会返回一个message字段，里面就是错误信息描述。
- post操作返回的内容都为空，所以post操作完成也只能通过http header中的status code来进行判断。
- 返回的数据同意放在result中。

** 测试用的token
   52a468d91d24ead09274284d

   在所有需要传user_id或者token的地方都传这个值就可以了。
   除了login接口之外都需要传token。

** 分页

所有返回列表的接口都支持分页，分页的使用方法如下：

*** 请求参数
| name      | type | required | desc         |
|-----------+------+----------+--------------|
| page      | int  | true     | 当前页数     |
| page_size | int  | true     | 每页数据条数 |

*** 返回
| name      | desc         |
|-----------+--------------|
| page      | 当前页数     |
| page_size | 每页数据条数 |

** 关于星星
- 看看谁能带我    看看谁要搭车    还有用户中心    这个星星通过搭车币可以升级的
- 上限为5个


* 车辆信息

** 看看谁能带我

*** 请求方法
GET

*** 路径
/rides

*** 请求参数
| name | type | required | desc     |
|------+------+----------+----------|
| lat  | str  | True     | 当前坐标 |
| lng  | str  | True     | 当前坐标 |

*** 返回
| name           | desc                  |
|----------------+-----------------------|
| title          | 标题                  |
| start_off_time | 搭车时间              |
| wait_time      | 可等待时间            |
| start_loc      | 乘车地点              |
| dest_loc       | 目的地                |
| start_addr     | 可阅读的乘车地点      |
| dest_addr      | 可阅读的目的地        |
| price          | 所需搭车币            |
| people         | 乘车人数              |
| comment        | 评论                  |
| distance       | 距离                  |
| user           | 用户信息（参见下面）  |
| car_type       | 车辆类型              |
| rating         | 星级（返回一个mock值) |



| name      | desc             |
|-----------+------------------|
| username  | 登陆的用户名     |
| nickname  | 昵称             |
| sex       | 性别 0：男 1：女 |
| image_url | 头像url          |

** 发布拼车服务

*** 请求方法
POST

*** 路径
/rides

