docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="index"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-13T12:30+0800"/>
<meta name="author" content="ccheng"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">index</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 注意事项</a></li>
<li><a href="#sec-2">2 网址</a>
<ul>
<li><a href="#sec-2-1">2.1 返回的格式</a></li>
<li><a href="#sec-2-2">2.2 测试用的token</a></li>
<li><a href="#sec-2-3">2.3 分页</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 请求参数</a></li>
<li><a href="#sec-2-3-2">2.3.2 返回</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 关于星星</a></li>
</ul>
</li>
<li><a href="#sec-3">3 车辆信息</a>
<ul>
<li><a href="#sec-3-1">3.1 看看谁能带我</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 请求方法</a></li>
<li><a href="#sec-3-1-2">3.1.2 路径</a></li>
<li><a href="#sec-3-1-3">3.1.3 请求参数</a></li>
<li><a href="#sec-3-1-4">3.1.4 返回</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 发布拼车服务</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 请求方法</a></li>
<li><a href="#sec-3-2-2">3.2.2 路径</a></li>
<li><a href="#sec-3-2-3">3.2.3 请求参数</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 看看谁能带我详情</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1 请求方法</a></li>
<li><a href="#sec-3-3-2">3.3.2 路径</a></li>
<li><a href="#sec-3-3-3">3.3.3 请求参数</a></li>
<li><a href="#sec-3-3-4">3.3.4 返回</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 乘客信息</a>
<ul>
<li><a href="#sec-4-1">4.1 看看谁要搭车</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 请求方法</a></li>
<li><a href="#sec-4-1-2">4.1.2 路径</a></li>
<li><a href="#sec-4-1-3">4.1.3 请求参数</a></li>
<li><a href="#sec-4-1-4">4.1.4 返回</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 我要搭车</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 请求方法</a></li>
<li><a href="#sec-4-2-2">4.2.2 路径</a></li>
<li><a href="#sec-4-2-3">4.2.3 请求参数</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 看看谁要搭车详情</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 请求方法</a></li>
<li><a href="#sec-4-3-2">4.3.2 路径</a></li>
<li><a href="#sec-4-3-3">4.3.3 请求参数</a></li>
<li><a href="#sec-4-3-4">4.3.4 返回</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 搜索</a>
<ul>
<li>
<ul>
<li><a href="#sec-5-1">5.1 请求方法</a></li>
<li><a href="#sec-5-2">5.2 路径</a></li>
<li><a href="#sec-5-3">5.3 请求参数</a></li>
<li><a href="#sec-5-4">5.4 返回</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 用户信息</a>
<ul>
<li><a href="#sec-6-1">6.1 上传新的用户信息</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1 请求方法</a></li>
<li><a href="#sec-6-1-2">6.1.2 路径</a></li>
<li><a href="#sec-6-1-3">6.1.3 请求参数</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2 用户登陆</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1 请求方法</a></li>
<li><a href="#sec-6-2-2">6.2.2 路径</a></li>
<li><a href="#sec-6-2-3">6.2.3 请求参数</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3 获取验证码</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1 请求方法</a></li>
<li><a href="#sec-6-3-2">6.3.2 路径</a></li>
<li><a href="#sec-6-3-3">6.3.3 请求参数</a></li>
<li><a href="#sec-6-3-4">6.3.4 返回值</a></li>
<li><a href="#sec-6-3-5">6.3.5 附加说明</a></li>
</ul>
</li>
<li><a href="#sec-6-4">6.4 验证手机号码</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1 请求方法</a></li>
<li><a href="#sec-6-4-2">6.4.2 路径</a></li>
<li><a href="#sec-6-4-3">6.4.3 请求参数</a></li>
<li><a href="#sec-6-4-4">6.4.4 附加说明</a></li>
</ul>
</li>
<li><a href="#sec-6-5">6.5 提交密码</a>
<ul>
<li><a href="#sec-6-5-1">6.5.1 请求方法</a></li>
<li><a href="#sec-6-5-2">6.5.2 路径</a></li>
<li><a href="#sec-6-5-3">6.5.3 请求参数</a></li>
</ul>
</li>
<li><a href="#sec-6-6">6.6 获取当前用户信息</a>
<ul>
<li><a href="#sec-6-6-1">6.6.1 请求方法</a></li>
<li><a href="#sec-6-6-2">6.6.2 路径</a></li>
<li><a href="#sec-6-6-3">6.6.3 请求参数</a></li>
<li><a href="#sec-6-6-4">6.6.4 返回值</a></li>
</ul>
</li>
<li><a href="#sec-6-7">6.7 根据用户id获取用户</a>
<ul>
<li><a href="#sec-6-7-1">6.7.1 请求方法</a></li>
<li><a href="#sec-6-7-2">6.7.2 路径</a></li>
<li><a href="#sec-6-7-3">6.7.3 请求参数</a></li>
<li><a href="#sec-6-7-4">6.7.4 返回值</a></li>
</ul>
</li>
<li><a href="#sec-6-8">6.8 捐赠搭车币</a>
<ul>
<li><a href="#sec-6-8-1">6.8.1 请求方法</a></li>
<li><a href="#sec-6-8-2">6.8.2 路径</a></li>
<li><a href="#sec-6-8-3">6.8.3 请求参数</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 我的评价</a>
<ul>
<li><a href="#sec-7-1">7.1 添加评论</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1 请求方法</a></li>
<li><a href="#sec-7-1-2">7.1.2 路径</a></li>
<li><a href="#sec-7-1-3">7.1.3 请求参数</a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2 查看评论某个用户的评论</a>
<ul>
<li><a href="#sec-7-2-1">7.2.1 请求方法</a></li>
<li><a href="#sec-7-2-2">7.2.2 路径</a></li>
<li><a href="#sec-7-2-3">7.2.3 请求参数</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 搭车流程</a>
<ul>
<li><a href="#sec-8-1">8.1 邀请搭车</a>
<ul>
<li><a href="#sec-8-1-1">8.1.1 请求方法</a></li>
<li><a href="#sec-8-1-2">8.1.2 路径</a></li>
<li><a href="#sec-8-1-3">8.1.3 请求参数</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-9">9 我的搭车记录</a>
<ul>
<li><a href="#sec-9-1">9.1 搭车记录列表</a>
<ul>
<li><a href="#sec-9-1-1">9.1.1 请求方法</a></li>
<li><a href="#sec-9-1-2">9.1.2 路径</a></li>
<li><a href="#sec-9-1-3">9.1.3 请求参数</a></li>
<li><a href="#sec-9-1-4">9.1.4 返回</a></li>
</ul>
</li>
<li><a href="#sec-9-2">9.2 评论</a>
<ul>
<li><a href="#sec-9-2-1">9.2.1 请求方法</a></li>
<li><a href="#sec-9-2-2">9.2.2 路径</a></li>
<li><a href="#sec-9-2-3">9.2.3 请求参数</a></li>
<li><a href="#sec-9-2-4">9.2.4 返回</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-10">10 Todo list</a>
<ul>
<li><a href="#sec-10-1">10.1 头像属性没看到呢，性别   星级  都还没做呢吗，ride接口中</a></li>
<li><a href="#sec-10-2">10.2 用户注册接口</a></li>
<li><a href="#sec-10-3">10.3 在projectile中添加debug的接口，用pdb完成</a></li>
<li><a href="#sec-10-4">10.4 看看谁能带我</a>
<ul>
<li><a href="#sec-10-4-1">10.4.1 还有要返回车主的坐标属性，因为我点击看地图要显示车主</a></li>
</ul>
</li>
<li><a href="#sec-10-5">10.5 性别、头像图片链接、星级个数都没看见</a></li>
<li><a href="#sec-10-6">10.6 还有   出发地  和   目的地能给文字吗</a></li>
<li><a href="#sec-10-7">10.7 没找到提bug的地方  直接说吧   用户手机登陆  使先post手机号   然后才能获得验证码的   不能一起提交的</a></li>
<li><a href="#sec-10-8">10.8 好像还缺个属性   我还得提交个车辆类型   这个是需求改动后加的</a></li>
<li><a href="#sec-10-9">10.9 服务器用debug模式部署</a></li>
<li><a href="#sec-10-10">10.10 查看新的文档，看看有什么东西是要改的</a></li>
<li><a href="#sec-10-11">10.11 完成首页的grid layout</a></li>
<li><a href="#sec-10-12">10.12 加入pagination</a></li>
<li><a href="#sec-10-13">10.13 我要搭车</a></li>
<li><a href="#sec-10-14">10.14 看看谁要搭车</a></li>
<li><a href="#sec-10-15">10.15 这是注册时候完善的   当我登陆时候用户中心里面还有一个我的个人信息和这个界面一样</a></li>
<li><a href="#sec-10-16">10.16 获取用户信息的接口</a></li>
<li><a href="#sec-10-17">10.17 完成侧边栏</a></li>
<li><a href="#sec-10-18">10.18 完成搜索模块的文档的添加</a></li>
<li><a href="#sec-10-19">10.19 有些细节问题   到时候最后了再改吧   就比如我现在计算的搭车币是  三公里之内5个搭车币   每多一公里加一个搭车币</a></li>
<li><a href="#sec-10-20">10.20 搜索类型不post给你吗？</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 注意事项</h2>
<div class="outline-text-2" id="text-1">

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 网址</h2>
<div class="outline-text-2" id="text-2">

<p>   <a href="http://192.241.196.189:10010">http://192.241.196.189:10010</a>
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 返回的格式</h3>
<div class="outline-text-3" id="text-2-1">


<ul>
<li>返回的数据格式为json。
</li>
<li>如果出错的话，header中的http status就不是200， 如果正常就为200.在出错的情况下会返回一个message字段，里面就是错误信息描述。
</li>
<li>post操作返回的内容都为空，所以post操作完成也只能通过http header中的status code来进行判断。
</li>
<li>返回的数据同意放在result中。
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 测试用的token</h3>
<div class="outline-text-3" id="text-2-2">

<p>   52a468d91d24ead09274284d
</p>
<p>
   在所有需要传user<sub>id或者token的地方都传这个值就可以了。</sub>
   除了login接口之外都需要传token。
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 分页</h3>
<div class="outline-text-3" id="text-2-3">


<p>
所有返回列表的接口都支持分页，分页的使用方法如下：
</p>

</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 请求参数</h4>
<div class="outline-text-4" id="text-2-3-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">name</th><th scope="col" class="left">type</th><th scope="col" class="left">required</th><th scope="col" class="left">desc</th></tr>
</thead>
<tbody>
<tr><td class="left">page</td><td class="left">int</td><td class="left">true</td><td class="left">当前页数</td></tr>
<tr><td class="left">page<sub>size</sub></td><td class="left">int</td><td class="left">true</td><td class="left">每页数据条数</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> 返回</h4>
<div class="outline-text-4" id="text-2-3-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">name</th><th scope="col" class="left">desc</th></tr>
</thead>
<tbody>
<tr><td class="left">page</td><td class="left">当前页数</td></tr>
<tr><td class="left">page<sub>size</sub></td><td class="left">每页数据条数</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 关于星星</h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li>看看谁能带我    看看谁要搭车    还有用户中心    这个星星通过搭车币可以升级的
</li>
<li>上限为5个
</li>
</ul>



</div>
</div>

</div>
