docs/index.org
*** 请求参数
| name           | type  | required | desc                       |
|----------------+-------+----------+----------------------------|
| title          | str   | True     | 标题                       |
| start_off_time | str   | True     | 搭车时间                   |
| wait_time      | str   | True     | 可等待时间                 |
| start_lat      | float | True     | 乘车地点lat                |
| start_lng      | float | True     | 乘车地点lng                |
| dest_lat       | float | True     | 目的地lat                  |
| dest_lng       | float | True     | 目的地lng                  |
| price          | int   | True     | 所需搭车币                 |
| people         | int   | True     | 乘车人数                   |
| comment        | str   | False    | 评论                       |
| car_type       | int   | False    | 车辆类型 0:自驾车 1:出租车 |


** 看看谁能带我详情

*** 请求方法
GET

*** 路径
/ride_detail

*** 请求参数
| name | type | required | desc                           |
|------+------+----------+--------------------------------|
| id   | str  | True     | 从*看看谁能带我*中获取*id*字段 |

*** 返回
FYI

* 乘客信息
** 看看谁要搭车
*** 请求方法
GET

*** 路径
/passengers

*** 请求参数
| name | type | required | desc     |
|------+------+----------+----------|
| lat  | str  | True     | 当前坐标 |
| lng  | str  | True     | 当前坐标 |

*** 返回
| name           | desc                  |
|----------------+-----------------------|
| title          | 标题                  |
| start_off_time | 搭车时间              |
| start_loc      | 乘车地点              |
| dest_loc       | 目的地                |
| start_addr     | 可阅读的乘车地点      |
| dest_addr      | 可阅读的目的地        |
| price          | 所需搭车币            |
| people         | 乘车人数              |
| comment        | 评论                  |
| distance       | 距离                  |
| user           | 用户信息（参见下面）  |
| rating         | 星级（返回一个mock值) |

** 我要搭车

*** 请求方法
POST

*** 路径
/passengers

*** 请求参数
| name           | type         | required | desc        |
|----------------+--------------+----------+-------------|
| title          | str          | True     | 标题        |
| start_off_time | str          | True     | 搭车时间    |
| wait_time      | str          | True     | 可等待时间  |
| start_lat      | float        | True     | 乘车地点lat |
| start_lng      | float        | True     | 乘车地点lng |
| dest_lat       | float        | True     | 目的地lat   |
| dest_lng       | float        | True     | 目的地lng   |
| price          | int          | True     | 所需搭车币  |
| people         | int          | True     | 乘车人数    |
| comment        | str          | False    | 评论        |


**** 用户信息

| name      | desc             |
|-----------+------------------|
| username  | 登陆的用户名     |
| nickname  | 昵称             |
| sex       | 性别 0：男 1：女 |
| image_url | 头像url            |

** 看看谁要搭车详情

*** 请求方法
GET

