docs/index.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 车辆信息</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 看看谁能带我</h3>
<div class="outline-text-3" id="text-3-1">



</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 请求方法</h4>
<div class="outline-text-4" id="text-3-1-1">

<p>GET
</p>
</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> 路径</h4>
<div class="outline-text-4" id="text-3-1-2">

<p>/rides
</p>
</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> 请求参数</h4>
<div class="outline-text-4" id="text-3-1-3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">name</th><th scope="col" class="left">type</th><th scope="col" class="left">required</th><th scope="col" class="left">desc</th></tr>
</thead>
<tbody>
<tr><td class="left">lat</td><td class="left">str</td><td class="left">True</td><td class="left">当前坐标</td></tr>
<tr><td class="left">lng</td><td class="left">str</td><td class="left">True</td><td class="left">当前坐标</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> 返回</h4>
<div class="outline-text-4" id="text-3-1-4">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">name</th><th scope="col" class="left">desc</th></tr>
</thead>
<tbody>
<tr><td class="left">title</td><td class="left">标题</td></tr>
<tr><td class="left">start<sub>off</sub><sub>time</sub></td><td class="left">搭车时间</td></tr>
<tr><td class="left">wait<sub>time</sub></td><td class="left">可等待时间</td></tr>
<tr><td class="left">start<sub>loc</sub></td><td class="left">乘车地点</td></tr>
<tr><td class="left">dest<sub>loc</sub></td><td class="left">目的地</td></tr>
<tr><td class="left">start<sub>addr</sub></td><td class="left">可阅读的乘车地点</td></tr>
<tr><td class="left">dest<sub>addr</sub></td><td class="left">可阅读的目的地</td></tr>
<tr><td class="left">price</td><td class="left">所需搭车币</td></tr>
<tr><td class="left">people</td><td class="left">乘车人数</td></tr>
<tr><td class="left">comment</td><td class="left">评论</td></tr>
<tr><td class="left">distance</td><td class="left">距离</td></tr>
<tr><td class="left">user</td><td class="left">用户信息（参见下面）</td></tr>
<tr><td class="left">car<sub>type</sub></td><td class="left">车辆类型</td></tr>
<tr><td class="left">rating</td><td class="left">星级（返回一个mock值)</td></tr>
</tbody>
</table>




<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">name</th><th scope="col" class="left">desc</th></tr>
</thead>
<tbody>
<tr><td class="left">username</td><td class="left">登陆的用户名</td></tr>
<tr><td class="left">nickname</td><td class="left">昵称</td></tr>
<tr><td class="left">sex</td><td class="left">性别 0：男 1：女</td></tr>
<tr><td class="left">image<sub>url</sub></td><td class="left">头像url</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 发布拼车服务</h3>
<div class="outline-text-3" id="text-3-2">



</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> 请求方法</h4>
<div class="outline-text-4" id="text-3-2-1">

<p>POST
</p>
</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> 路径</h4>
<div class="outline-text-4" id="text-3-2-2">

<p>/rides
</p>
</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> 请求参数</h4>
<div class="outline-text-4" id="text-3-2-3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">name</th><th scope="col" class="left">type</th><th scope="col" class="left">required</th><th scope="col" class="left">desc</th></tr>
</thead>
<tbody>
<tr><td class="left">title</td><td class="left">str</td><td class="left">True</td><td class="left">标题</td></tr>
<tr><td class="left">start<sub>off</sub><sub>time</sub></td><td class="left">str</td><td class="left">True</td><td class="left">搭车时间</td></tr>
<tr><td class="left">wait<sub>time</sub></td><td class="left">str</td><td class="left">True</td><td class="left">可等待时间</td></tr>
<tr><td class="left">start<sub>lat</sub></td><td class="left">float</td><td class="left">True</td><td class="left">乘车地点lat</td></tr>
<tr><td class="left">start<sub>lng</sub></td><td class="left">float</td><td class="left">True</td><td class="left">乘车地点lng</td></tr>
<tr><td class="left">dest<sub>lat</sub></td><td class="left">float</td><td class="left">True</td><td class="left">目的地lat</td></tr>
<tr><td class="left">dest<sub>lng</sub></td><td class="left">float</td><td class="left">True</td><td class="left">目的地lng</td></tr>
<tr><td class="left">price</td><td class="left">int</td><td class="left">True</td><td class="left">所需搭车币</td></tr>
<tr><td class="left">people</td><td class="left">int</td><td class="left">True</td><td class="left">乘车人数</td></tr>
<tr><td class="left">comment</td><td class="left">str</td><td class="left">False</td><td class="left">评论</td></tr>
<tr><td class="left">car<sub>type</sub></td><td class="left">int</td><td class="left">False</td><td class="left">车辆类型 0:自驾车 1:出租车</td></tr>
</tbody>
</table>



</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 看看谁能带我详情</h3>
<div class="outline-text-3" id="text-3-3">



</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> 请求方法</h4>
<div class="outline-text-4" id="text-3-3-1">

<p>GET
</p>
</div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> 路径</h4>
<div class="outline-text-4" id="text-3-3-2">

<p>/ride<sub>detail</sub>
</p>
</div>

</div>

<div id="outline-container-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> 请求参数</h4>
<div class="outline-text-4" id="text-3-3-3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">name</th><th scope="col" class="left">type</th><th scope="col" class="left">required</th><th scope="col" class="left">desc</th></tr>
</thead>
<tbody>
<tr><td class="left">id</td><td class="left">str</td><td class="left">True</td><td class="left">从*看看谁能带我*中获取*id*字段</td></tr>
</tbody>
</table>


</div>

</div>
